app/views/quotes/_form.html.erb

      <%= f.label :philosopher_id %>
      <%= f.collection_select(:philosopher_id, Philosopher.all, :id, :fname, { include_blank: 'Select a Philosopher' }, class: 'form-control') %>
---
SELECT "philosophers".* FROM "philosophers"

      <!-- Commence looping through each of the quote's categories -->
      <% @quote.quote_categories.each do |quote_category| %>
---
SELECT "categories".* FROM "categories"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 2]]

              <%= qc.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
              <%= qc.select :category_id, Category.all.collect { |cat| [cat.cat_name, cat.id] }, { include_blank: true }, class: "form-control d-inline-block" %>
---
SELECT "categories".* FROM "categories"