app/controllers/home_controller.rb

  def index
    @quotes = Quote.includes(:philosopher).where(is_public:true).last(5)
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = ? ORDER BY "quotes"."id" DESC LIMIT ?  [["is_public", 1], ["LIMIT", 5]]

  def uquotes
    @quotes =Quote.includes(:philosopher).where(user_id: session[:user_id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 15]]
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 9]]