app/controllers/philosophers_controller.rb

SELECT "philosophers".* FROM "philosophers"
---
  def index
    @philosophers = Philosopher.all

INSERT INTO "philosophers" ("fname", "lname", "birth_year", "death_year", "short_bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @philosopher = Philosopher.new(philosopher_params)

    respond_to do |format|
      if @philosopher.save

UPDATE "philosophers" SET "birth_year" = ?, "updated_at" = ? WHERE "philosophers"."id" = ?  [["birth_year", 1918], ["updated_at", "2023-10-18 09:38:51.048581"], ["id", 10]]
---
  def update
    if logged_in? && current_user.is_admin?
      respond_to do |format|
        if @philosopher.update(philosopher_params)

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def set_philosopher
      @philosopher = Philosopher.find(params[:id])