app/controllers/quotes_controller.rb

  def create
    @quote = Quote.new(quote_params)
    respond_to do |format|
      if @quote.save
---
INSERT INTO "quotes" ("text", "publication_year", "is_public", "comment", "user_id", "philosopher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if current_user.id == @quote.user_id || current_user.is_admin?
      respond_to do |format|
        if @quote.update(quote_params)
---
UPDATE "quotes" SET "comment" = ?, "user_id" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["comment", "life like this, lalala"], ["user_id", 14], ["updated_at", "2023-10-18 07:13:47.333768"], ["id", 5]]

  def destroy
    if current_user.id == @quote.user_id || current_user.is_admin?
      @quote.destroy
---
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 36]]