app/controllers/search_controller.rb

  def index
    category_query = params[:category_query]
    if category_query.present?
    @quotematch = Quote.joins(:quote_categories, :categories).where("categories.cat_name LIKE ?", "%#{category_query}%").where(is_public: true).distinct
---
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "quote_categories" "quote_categories_quotes_join" ON "quote_categories_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories_quotes_join"."category_id" WHERE (categories.cat_name LIKE '%Art%') AND "quotes"."is_public" = ?  [["is_public", 1]]