app/controllers/users_controller.rb

  def index
    #@users = User.all
    # check whether the user is admin, retrieve all users if so.
    if logged_in? && is_administrator?
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if !@user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "lname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lname", "Lu11"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-10-18 09:57:24.946773"], ["id", 21]]